Revit 2027 API
NurbSpline.isRational Property
Returns whether the nurb spline is rational or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool isRational { get; }
Public ReadOnly Property isRational As Boolean
	Get
public:
property bool isRational {
	bool get ();
}
member isRational : bool with get
Property Value
Boolean
See Also
Reference
NurbSpline Class
Autodesk.Revit.DB Namespace